app/controllers/gists_controller.rb

SELECT  "gists".* FROM "gists"  WHERE (description LIKE '%b%')  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "gists"
---
 def index
    #@gists = Gist.all
    #@gists = Gist.paginate(page: params[:page], per_page: 8)
    @gists = Gist.paginate(:page => params[:page]).search(params[:search])

SELECT  "gists".* FROM "gists"  WHERE "gists"."id" = ?  ORDER BY created_at DESC LIMIT 1 OFFSET 0  [["id", "all"]]
---
    def set_gist
      @gist = Gist.find(params[:id])